# # დავალება 2: ლოგიკური ოპერატორები

# #     1.    დაწერე პროგრამა, რომელიც შეამოწმებს, არის თუ არა მოცემული რიცხვი დადებითი და ლუწი ერთდროულად. გამოიყენე and ოპერატორი.
# #     2.    დაწერე კოდი, რომელიც შეამოწმებს, არის თუ არა რიცხვი ან 5-ზე მეტი ან უარყოფითი. გამოიყენე or ოპერატორი.
# num = 12
# if num % 12:
#     print("ეს რიცხვი ლუწია")
# elif num > 12:
#     print("ეს რიცხვი დადებითია")


#  3.    შექმენი ცვლადი x და მიანიჭე მას რაიმე მნიშვნელობა. შემდეგ დაწერე if პირობა, რომელიც გამოიყენებს not ოპერატორს:
    # •    თუ x არ უდრის 0-ს, დაბეჭდე “x არ არის 0.”

x = 13
if x != 0:
    print("x არ არის 0.")
else:
    print("x არის 0")
