# # დავალება 1: შედარების ოპერატორები

#1.დაწერე კოდი, რომელიც შეადარებს ორ რიცხვს a და b. შედეგი უნდა გამოიტანოს შემდეგნაირად:
#     •    თუ a უფრო მეტია b-ზე, დაბეჭდე: “a უფრო მეტია b-ზე.”
#     •    თუ a ნაკლებია b-ზე, დაბეჭდე: “a ნაკლებია b-ზე.”
#     •    თუ a ტოლია b-ს, დაბეჭდე: “a ტოლია b-ს.”
#     2.    გამოიყენე ==, !=, >, <, >=, <= ოპერატორები შემდეგი წყვილების შედარებისთვის:
#     •    5 და 10
#     •    15 და 15
#     •    -3 და 2

a = 10
b = 5
if a > b:
    print("a უფრო მეტია b-ზე.")
elif a < b:
    print("a ნაკლებია b-ზე.")
elif a == b:
    print("a ტოლია b-ს.")