# # 
# დავალება 3: სპეციალური ოპერატორები

#     1.    დაწერე კოდი, რომელიც გამოიყენებს in ოპერატორს, რომ შეამოწმოს, არის თუ არა კონკრეტული სიმბოლო სტრიქონში. მაგალითად, შეამოწმე არის თუ არა ‘a’ სიტყვაში ‘apple’.
#     2.    დაწერე კოდი, რომელიც გამოიყენებს is ოპერატორს, რომ შეამოწმოს, ორი ცვლადი მიუთითებს თუ არა ერთსა და იმავე ობიექტზე.
#     3.    დაწერე კოდი, რომელიც შეამოწმებს, არის თუ არა რაიმე რიცხვი None მნიშვნელობის მქონე ცვლადთან.

# a = 'apple'
# x = 'a'
# if a in x:
    # print("a is in x")
# else:
    # print('a არ არის x ში')


# 2.    დაწერე კოდი, რომელიც გამოიყენებს is ოპერატორს, რომ შეამოწმოს, ორი 
# ცვლადი მიუთითებს თუ არა ერთსა და იმავე ობიექტზე.

y = 'GOA'
p = 'GOA'
if y is p:
    print("ეს არის ერთი და იგივე")
else:
    print("ეს არ არის იგივე")